0xsmirk/mcu_cmsis_svd/NXP/LPC11xx_v6.svd
  		</registers>
  	</peripheral>
	
  	
  	
	<peripheral>
        <name>SPI0</name>
        <description>SPI0</description>
        <groupName>SPI</groupName>
        <baseAddress>0x40040000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>SPI0</name>
			<value>20</value>
		</interrupt>
		<registers>																							
			<register>
				<name>CR0</name>
				<description>Control Register 0. Selects the serial clock rate, bus type, and data size.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DSS</name>
						<description>Data Size Select. This field controls the number of bits transferred in each frame. Values 0000-0010 are not supported and should not be used.</description>
						<bitRange>[3:0]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>4_BIT_TRANSFER</name>
								<description>4-bit transfer</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>5_BIT_TRANSFER</name>
								<description>5-bit transfer</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>6_BIT_TRANSFER</name>
								<description>6-bit transfer</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>7_BIT_TRANSFER</name>
								<description>7-bit transfer</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>8_BIT_TRANSFER</name>
								<description>8-bit transfer</description>
								<value>0x7</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>9_BIT_TRANSFER</name>
								<description>9-bit transfer</description>
								<value>0x8</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>10_BIT_TRANSFER</name>
								<description>10-bit transfer</description>
								<value>0x9</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>11_BIT_TRANSFER</name>
								<description>11-bit transfer</description>
								<value>0xA</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>12_BIT_TRANSFER</name>
								<description>12-bit transfer</description>
								<value>0xB</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>13_BIT_TRANSFER</name>
								<description>13-bit transfer</description>
								<value>0xC</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>14_BIT_TRANSFER</name>
								<description>14-bit transfer</description>
								<value>0xD</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>15_BIT_TRANSFER</name>
								<description>15-bit transfer</description>
								<value>0xE</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>16_BIT_TRANSFER</name>
								<description>16-bit transfer</description>
								<value>0xF</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>FRF</name>
						<description>Frame Format.</description>
						<bitRange>[5:4]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>SPI</name>
								<description>SPI</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TI</name>
								<description>TI</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>MICROWIRE</name>
								<description>Microwire</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>This combination is not supported and should not be used.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CPOL</name>
						<description>Clock Out Polarity. This bit is only used in SPI mode.</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>LOW</name>
								<description>SPI controller maintains the bus clock low between frames.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>HIGH</name>
								<description>SPI controller maintains the bus clock high between frames.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CPHA</name>
						<description>Clock Out Phase. This bit is only used in SPI mode.</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>FIRSTCLOCK</name>
								<description>SPI controller captures serial data on the first clock transition of the frame, that is, the transition away from the inter-frame state of the clock line.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SECONDCLOCK</name>
								<description>SPI controller captures serial data on the second clock transition of the frame, that is, the transition back to the inter-frame state of the clock line.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SCR</name>
						<description>Serial Clock Rate. The number of prescaler output clocks per bit on the bus, minus one. Given that CPSDVSR is the prescale divider, and the APB clock PCLK clocks the prescaler, the bit frequency is PCLK / (CPSDVSR X [SCR+1]).</description>
						<bitRange>[15:8]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:16]</bitRange>
						
					</field>
				</fields>
			</register>																						
			<register>																						
				<name>CR1</name>																					
				<description>Control Register 1. Selects master/slave and other modes.</description>																					
				<addressOffset>0x004</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>LBM</name>																			
						<description>Loop Back Mode.</description>																			
						<bitRange>[0:0]</bitRange>																			
						<enumeratedValues>																			
						<name>test</name>																			
							<enumeratedValue>																		
								<name>NORMAL</name>																	
								<description>During normal operation.</description>																	
								<value>0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>LOOPBACK</name>																	
								<description>Serial input is taken from the serial output (MOSI or MISO) rather than the serial input pin (MISO or MOSI respectively).</description>																	
								<value>1</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>SSE</name>																			
						<description>SPI Enable.</description>																			
						<bitRange>[1:1]</bitRange>																			
						<enumeratedValues>																			
						<name>test</name>																			
							<enumeratedValue>																		
								<name>DISABLE</name>																	
								<description>The SPI controller is disabled.</description>																	
								<value>0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ENABLE</name>																	
								<description>The SPI controller will interact with other devices on the serial bus. Software should write the appropriate control information to the other SPI/SSP registers and interrupt controller registers, before setting this bit.</description>																	
								<value>1</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>MS</name>																			
						<description>Master/Slave Mode.This bit can only be written when the SSE bit is 0.</description>																			
						<bitRange>[2:2]</bitRange>																			
						<enumeratedValues>																			
						<name>test</name>																			
							<enumeratedValue>																		
								<name>MASTER</name>																	
								<description>The SPI controller acts as a master on the bus, driving the SCLK, MOSI, and SSEL lines and receiving the MISO line.</description>																	
								<value>0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>SLAVE</name>																	
								<description>The SPI controller acts as a slave on the bus, driving MISO line and receiving SCLK, MOSI, and SSEL lines.</description>																	
								<value>1</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>SOD</name>																			
						<description>Slave Output Disable. This bit is relevant only in slave mode (MS = 1). If it is 1, this blocks this SPI controller from driving the transmit data line (MISO).</description>																			
						<bitRange>[3:3]</bitRange>																			
																		
