0xsmirk/mcu_cmsis_svd/NXP/LPC11xx_v6.svd
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_DCD_LOC</name>
			<description>DCD pin location select register</description>
			<addressOffset>0x0B8</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DCDLOC</name>
					<description>Selects pin location for DCD function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_DCD_FUNCTIO</name>
							<description>Selects  DCD function in pin location PIO2_2/DCD/MISO1 (see  Table 126).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_DCD_FUNCTION</name>
							<description>Selects DCD function in pin location PIO3_2/DCD (see  Table 142).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_RI_LOC</name>
			<description>RI pin location select register</description>
			<addressOffset>0x0BC</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RILOC</name>
					<description>Selects pin location for RI function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_RI_FUNCTION</name>
							<description>Selects  RI function in pin location PIO2_3/RI/MOSI1 (see Table 138).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_RI_FUNCTION_</name>
							<description>Selects RI function in pin location PIO3_3/RI (see Table 146).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_SSEL1_LOC</name>
			<description>SSEL1 pin location select register</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSEL1LOC</name>
					<description>Selects pin location for SSEL1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_SSEL1_FUNCTI</name>
							<description>Selects SSEL1 function in pin location PIO2_2/DCD/MISO1 (see Table 126).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SSEL1_FUNCTI</name>
							<description>Selects SSEL1 function in pin location  PIO2_4/CT16B1_MAT1/SSEL1 (see Table 119).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_CT16B0_CAP0_LOC</name>
			<description>CT16B0_CAP0 pin location select register</description>
			<addressOffset>0x0C0</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CT16B0_CAP0LOC</name>
					<description>Selects pin location for CT16B0_CAP0 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_CT16B0_CAP0_</name>
							<description>Selects CT16B0_CAP0 function in pin location PIO0_2/SSEL0/CT16B0_CAP0 (see  Table 110).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_CT16B0_CAP0_</name>
							<description>Selects CT16B0_CAP0 function in pin location PIO3_3/RI/CT16B0 (see Table 146).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_SCK1_LOC</name>
			<description>SCK1 pin location select register</description>
			<addressOffset>0x0C4</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCK1LOC</name>
					<description>Selects pin location for SCK1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_SCK1_FUNCTIO</name>
							<description>Selects SCK1 function in pin location PIO2_1/DSR/SCK1 (see Table 113).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SCK1_FUNCTIO</name>
							<description>Selects SCK1 function in pin location PIO3_2/DCD/CT16B0_MAT2/SCK1 (see Table 142).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
