0xsmirk/mcu_cmsis_svd/NXP/LPC11xx_v6.svd
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_MISO1_LOC</name>
			<description>MISO1 pin location select register</description>
			<addressOffset>0x0C8</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MISO1LOC</name>
					<description>Selects pin location for the MISO1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_MISO1_FUNCTI</name>
							<description>Selects MISO1 function in pin location PIO2_2/DCD/MISO1 (see Table 126).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_MISO1_FUNCTI</name>
							<description>Selects MISO1 function in pin location PIO1_10/AD6/CT16B1_MAT1/MISO1 (see  Table 130).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_MOSI1_LOC</name>
			<description>MOSI1 pin location select register</description>
			<addressOffset>0x0CC</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MOSI1LOC</name>
					<description>Selects pin location for the MOSI1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_MOSI1_FUNCTI</name>
							<description>Selects MOSI1 function in pin location PIO2_3/RI/MOSI1 (see Table 138).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_MOSI1_FUNCTI</name>
							<description>Selects MOSI1 function in pin location PIO1_9/CT16B1_MAT0/MOSI1 (see Table 117).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_CT32B0_CAP0_LOC</name>
			<description>CT32B0_CAP0 pin location select register</description>
			<addressOffset>0x0D0</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CT32B0_CAP0LOC</name>
					<description>Selects pin location for the CT32B0_CAP0 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_CT32B0_CAP0_</name>
							<description>Selects CT32B0_CAP0 function in pin location PIO1_5/RTS/CT32B0_CAP0 (see Table 143).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_CT32B0_CAP0_</name>
							<description>Selects CT32B0_CAP0 function in pin location PIO2_9/CT32B0_CAP0 (Table 124).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>IOCON_RXD_LOC</name>
			<description>RXD pin location select register</description>
			<addressOffset>0x0D4</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXDLOC</name>
					<description>Selects pin location for the RXD function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO1_6/RXD/CT32B0_MAT0 (see Table 144).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO2_7/CT32B0_MAT2/RXD (see Table 111).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO3_1/DSR/CT16B0_MAT1/RXD (see Table 137).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO3_4/CT16B0_CAP1/RXD (see Table 118).</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
										
										
	</registers>
</peripheral>


	<peripheral>
	<name>SYSCON</name>
	<description>Product name title=UM10398 Chapter title=LPC111x/LPC11Cxx
System configuration (SYSCON) Modification date=2/22/2012 Major revision=8 Minor revision=not available </description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x40048000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>BOD</name>
	<value>26</value>
	</interrupt>
	<interrupt>
	<name>PIO0_0</name>
	<value>0</value>
	</interrupt>
	<interrupt>
	<name>PIO0_1</name>
	<value>1</value>
	</interrupt>
	<interrupt>
	<name>PIO0_2</name>
	<value>2</value>
	</interrupt>
	<interrupt>
	<name>PIO0_3</name>
	<value>3</value>
	</interrupt>
	<interrupt>
	<name>PIO0_4</name>
	<value>4</value>
	</interrupt>
	<interrupt>
	<name>PIO0_5</name>
	<value>5</value>
	</interrupt>
	<interrupt>
	<name>PIO0_6</name>
	<value>6</value>
	</interrupt>
	<interrupt>
	<name>PIO0_7</name>
	<value>7</value>
	</interrupt>
	<interrupt>
	<name>PIO0_8</name>
	<value>8</value>
	</interrupt>
	<interrupt>
	<name>PIO0_9</name>
	<value>9</value>
	</interrupt>
	<interrupt>
	<name>PIO0_10</name>
	<value>10</value>
	</interrupt>
	<interrupt>
	<name>PIO0_11</name>
	<value>11</value>
	</interrupt>
	<interrupt>
	<name>PIO1_0</name>
	<value>12</value>
	</interrupt>
	<registers>
		<register>
			<name>SYSMEMREMAP</name>
			<description>System memory remap</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x002</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAP</name>
					<description>System memory remap</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BOOT_LOADER_MODE_IN</name>
							<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_RAM_MODE_INTER</name>
							<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_FLASH_MODE_INT</name>
							<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

